tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"
brew "act"
brew "asdf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "curl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "pick"
brew "ripgrep"
brew "starship"
