cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "pulumi/tap"
tap "raggi/ale"

brew "ack"
brew "act"
brew "asdf"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "cmake"
brew "coreutils"
brew "crystal"
brew "cscope"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq"
brew "editorconfig"
brew "elixir"
brew "exa"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "libtool"
brew "macvim"
brew "neovim"
brew "nginx"
brew "nodenv"
brew "noti"
brew "pgformatter"
brew "pick"
brew "postgresql"
brew "pstree"
brew "pulumi/tap/pulumi"
brew "raggi/ale/openssl-osx-ca"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"

cask "1password-cli"
cask "aws-vault"
cask "dropbox"
cask "font-fira-code"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "micro-snitch"
cask "ngrok"
cask "tunnelblick"
