cask_args appdir: "/Applications"

tap "codeclimate/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "puma/puma"
tap "raggi/ale"

brew "ack"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "brew-cask-completion"
brew "cmake"
brew "crystal"
brew "cscope"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "dnsmasq"
brew "editorconfig"
brew "elixir"
brew "exa"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "ghostscript"
brew "git"
brew "go"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "libffi"
brew "libtool"
brew "macvim"
brew "mas"
brew "memcached"
brew "nektos/tap/act"
brew "neovim"
brew "nginx"
brew "nodenv"
brew "noti"
brew "perl"
brew "pgformatter"
brew "pick"
brew "postgresql"
brew "pstree"
brew "puma/puma/puma-dev"
brew "pyenv"
brew "pyenv-virtualenv"
brew "raggi/ale/openssl-osx-ca"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"

cask "1password-cli"
cask "atext"
cask "aws-vault"
cask "brave-browser"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-meslo-for-powerline"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "micro-snitch"
cask "ngrok"
cask "slack"
cask "spotify"
cask "tunnelblick"

mas "Amphetamine", id: 937984704
mas "HTTP Client", id: 418138339
mas "Magnet", id: 441258766
mas "Pastebot", id: 1179623856
mas "Xcode", id: 497799835
# mas "aText", id: 488566438 # aText hack: https://www.trankynam.com/atext/doc/index.html#line2
