cask_args appdir: "/Applications"

tap "codeclimate/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "nektos/tap"
tap "puma/puma"
tap "raggi/ale"

brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "cmake"
brew "crystal"
brew "cscope"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "editorconfig"
brew "elixir"
brew "fzf"
brew "geckodriver"
brew "ghostscript"
brew "git"
brew "go"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kryptco/tap/kr"
brew "leiningen"
brew "libffi"
brew "libtool"
brew "macvim"
brew "memcached"
brew "nektos/tap/act"
brew "neovim"
brew "nginx"
brew "nodenv"
brew "noti"
brew "perl"
brew "pgformatter"
brew "pick"
brew "postgresql"
brew "pstree"
brew "puma/puma/puma-dev"
brew "pyenv"
brew "pyenv-virtualenv"
brew "raggi/ale/openssl-osx-ca"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "yarn"

cask "google-cloud-sdk"
cask "ngrok"
cask "homebrew/cask-fonts/font-meslo-for-powerline"
